TRUNCATE TABLE
    medical_records,
    appointments,
    procedures,
    pets,
    breeds,
    vets,
    vet_specializations,
    pet_owners
RESTART IDENTITY CASCADE;

INSERT INTO pet_owners (id, first_name, last_name, contact_number, email, address, registration_date) VALUES
('11111111-1111-1111-1111-111111111111', 'Иван', 'Иванов', '+79991234567', 'ivan.ivanov@example.com', 'г. Москва, ул. Образцова, д. 9к9', '2023-01-15'),
('22222222-2222-2222-2222-222222222222', 'Мария', 'Петрова', '+79997654321', 'maria.petrova@example.com', 'г. Москва, ул. Образцова, д. 9к9', '2023-02-20'),
('33333333-3333-3333-3333-333333333333', 'Алексей', 'Сидоров', '+79991112233', 'alexey.sidorov@example.com', 'г. Москва, ул. Образцова, д. 9к9', '2023-03-10');

INSERT INTO breeds (pet_type, name) VALUES
('Собака', 'Лабрадор'),
('Кошка', 'Британская'),
('Собака', 'Хаски'),
('Кошка', 'Мейн-кун');

INSERT INTO pets (id, owner_id, breed_id, nickname, date_of_birth, sex, weight) VALUES
('11111111-1111-1111-1111-11111111111a', '11111111-1111-1111-1111-111111111111', 1, 'Барбос', '2020-05-15', 'MALE', 25.5),
('22222222-2222-2222-2222-22222222222a', '22222222-2222-2222-2222-222222222222', 2, 'Мурка', '2021-08-20', 'FEMALE', 4.2),
('33333333-3333-3333-3333-33333333333a', '11111111-1111-1111-1111-111111111111', 3, 'Бакс', '2019-11-10', 'MALE', 22.0),
('44444444-4444-4444-4444-44444444444a', '33333333-3333-3333-3333-333333333333', 4, 'Симба', '2022-01-05', 'UNKNOWN', 6.8);

